
__author__ = 'Осипов Алексей Петрович'

# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

print("\n#1:\n")
fruits = ["яблоко", "банан", "киви", "арбуз"]
i = 0
for fruit in fruits:
    i = i + 1
    print('{}. {:>6}'.format(i, fruit))

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

print("\n#2:\n")

list_1 = [22, 23, 1, 2, 3, 3, 3, 4, 7, 8, 9, 4, 3]
list_2 = [3, 4, 5, 8, 22]
list_3 = []

# Вариант дающий правильный результат
print(list_1)
print(list_2)

for element in list_1:
    if element not in list_2:
        list_3.append(element)

print(list_3)

# Вариант работающий по условиям задачи
print(list_1)
print(list_2)

for element in list_1:
    if element in list_2:
        list_1.remove(element)

print(list_1)



# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

print("\n#3:\n")

list_1 = [22, 23, 1, 2, 3, 3, 3, 4, 7, 8, 9, 4, 3]
list_2 = []

for element in list_1:
    if element % 2 == 0:
        print(element)
        list_2.append(element / 4)
    else:
        list_2.append(element * 2)

print(list_2)