
__author__ = 'Осипов Алексей Петрович'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# код пишем тут...

print("Введите число: ")
chislo = input()
i = 10
while ((int(chislo) / i) > 0.09):
    print(int((int(chislo) % i) // (i / 10)))
    i = i * 10


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

print("Введите число 1: ")
chislo1 = int(input())
print("Введите число 2: ")
chislo2 = int(input())

temp = chislo2
chislo2 = chislo1
chislo1 = temp
print(chislo1, chislo2)

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"
print("Введите возраст: ")
vozrast = int(input())
if (vozrast >= 18):
    print("Доступ разрешен")
else:
    print("Извините, пользование данным ресурсом только с 18 лет")

