
__author__ = 'Осипов Алексей Петрович'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

x = 58375
i = 10
maxC = 0

while (x % i > 0):
    maxC = x % i if x % i > maxC else maxC
    x = int(x / 10)
print(maxC)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

print("Введите число 1: ")
chislo1 = int(input())
print("Введите число 2: ")
chislo2 = int(input())

chislo1 = chislo1 + chislo2
chislo2 = chislo1 - chislo2
chislo1 = chislo1 - chislo2
print(chislo1, chislo2)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

import math

print("Введите коэффициент a: ")
a = int(input())
print("Введите коэффициент b: ")
b = int(input())
print("Введите коэффициент c: ")
c = int(input())

D = b**2 - 4*a*c
print(D)

if D > 0:
    x1 = (math.sqrt(D) - b) / (2 * a)
    x2 = (-math.sqrt(D) - b) / (2 * a)
    print("Корни:", x1, x2)
elif D == 0:
    x = -b / (2 * a)
    print("Корень:", x)
elif D < 0:
    print("Корней нет")
